docs/software_projects.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>software-projects</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="org-default.css" />
</head>
<body>
<div id="content" class="container content">
<nav class="navbar is-black" id="org846edb1">
<div class="navbar-brand" id="orgf4f5440">
<div class="navbar-item" id="org787ff20">
<p>
<a href="index.html#ID-3a34d6d7-6f37-4573-b20e-3c93894e54ac">🏠</a>
</p>

</div>

</div>
<div class="navbar-menu" id="org23cc736">
<div class="navbar-start" id="orgb2d2b4b">
<div class="navbar-item" id="orge68142e">
<p>
<a href="site_map.html#ID-30ea5e38-9b41-4bcd-8631-76821e93e294">🗺</a>
</p>

</div>

</div>
<div class="navbar-end" id="org7fd00e1">

</div>

</div>
</nav>
<div id="outline-container-orgfff4052" class="outline-2">
<h2 id="orgfff4052">software projects</h2>
<div class="outline-text-2" id="text-orgfff4052">
<p>
The coding will continue until morale improves!
</p>
</div>
<div id="outline-container-orgc12e60f" class="outline-3">
<h3 id="orgc12e60f">working</h3>
<div class="outline-text-3" id="text-orgc12e60f">
<ul class="org-ul">
<li>key2words
<ul class="org-ul">
<li>rust cli executable that uses bip39 to generate mneumonics from ed25519 keys.
<ul class="org-ul">
<li>bulma/yew web ui form too</li>
</ul></li>
<li>supports passphrase encryption and decryption of ssh/gpg</li>
<li>added onion service secret file generation
<ul class="org-ul">
<li>takes 1 set of words and makes a hidden service behind ssh with pgp signing/encryption for that set of bytes</li>
</ul></li>
<li><b>Service Worker require third party cookies</b> <code>chrome://settings/cookies</code></li>
</ul></li>
</ul>
<iframe src="https://jamartin9.github.io/key2words/index.html" width="100%" height="300" id="org3bb9d02">
</iframe>
</div>

<div id="outline-container-org4564fd0" class="outline-4">
<h4 id="org4564fd0">personal</h4>
<div class="outline-text-4" id="text-org4564fd0">
<ul class="org-ul">
<li>guix-channel
<ul class="org-ul">
<li>guile scheme guix channel for custom packages</li>
<li>mostly packages that are in process or unsuitable for nonguix or other repos
<ul class="org-ul">
<li>zfs
<ul class="org-ul">
<li>add pam user login mounting :wip:</li>
<li>add root initramfs support :wip:</li>
</ul></li>
<li>add graft support for nvda to browsers :wip:</li>
</ul></li>
</ul></li>
<li>emacs-config
<ul class="org-ul">
<li>elisp/org configuration for emacs</li>
<li>uses elisp wrapper script to untangle/eval org file code for setup</li>
<li>uses submodules for guix-channel of with custom emacs packages</li>
<li>publishes site from org-mode files
<ul class="org-ul">
<li>does not use org-publish but each page is customizable from the org-roam-capture-template header</li>
</ul></li>
</ul></li>
<li>resume
<ul class="org-ul">
<li>org file of my resume for latex to pdf export</li>
<li>includes stencil cover letter</li>
<li>pgp public key in profile picture qr code
<ul class="org-ul">
<li>customize qr code image?</li>
</ul></li>
<li>PDF links to projects/pages</li>
</ul></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org689b610" class="outline-3">
<h3 id="org689b610">old</h3>
<div class="outline-text-3" id="text-org689b610">
<ul class="org-ul">
<li>matching
<ul class="org-ul">
<li>CUDA project for implementing the stable matching algorithm
<ul class="org-ul">
<li>uses flattened 2d matrix structure to avoid pointer deref and multiplex access for the third dimension of block threads</li>
<li>uses managed malloc api to avoid pinning/pointer deference performance issues</li>
<li>limitation of 1024 x 3 concurrent problem size (api limit of x + y + z of threads in block execution) with respect to O(n log n ^2) complexity :wip:
<ul class="org-ul">
<li>limited by find minimum (reduction) kernel which depends on the results of other parallel processes to finish the step in log n. (maybe solve with eventually consistent atmoic ops queue to avoid blocking?) nvidia's reduction kernel is O(n log n) as it is unbounded size despite extensive optimizations like block unrolling.</li>
<li>removing the concurrent requirement of several steps would raise the max problem size to 1024 X 3 X 65535 per step invocation</li>
</ul></li>
</ul></li>
<li>done as REU</li>
<li>obe <a href="https://ashvardanian.com/posts/searching-stable-marriages/">for vector db</a> (measuring closeness representation for large sets)</li>
</ul></li>
</ul>
</div>
</div>
</div>
</div>
</body>
</html>